Heltec-Aaron-Lee/WiFi_Kit_series/boards.txt
heltec_wifi_lora_32_V3.menu.SLOW_CLK_TPYE.0=Internal (default)
heltec_wifi_lora_32_V3.menu.SLOW_CLK_TPYE.0.build.SLOW_CLK_TPYE=0
heltec_wifi_lora_32_V3.menu.SLOW_CLK_TPYE.1=External 32K
heltec_wifi_lora_32_V3.menu.SLOW_CLK_TPYE.1.build.SLOW_CLK_TPYE=1

heltec_wifi_lora_32_V3.build.defines=-D{build.band} -DMCU_ESP32_S3 -DHELTEC_BOARD=30 -DWIFI_LORA_32_V3 -DSLOW_CLK_TPYE={build.SLOW_CLK_TPYE} -DRADIO_CHIP_SX1262  -DLoRaWAN_DEBUG_LEVEL={build.LoRaWanDebugLevel} -DACTIVE_REGION=LORAMAC_{build.band} -DLORAWAN_PREAMBLE_LENGTH={build.LORAWAN_PREAMBLE_LENGTH} -DLORAWAN_DEVEUI_AUTO={build.LORAWAN_DEVEUI_AUTO} -D{build.board}

heltec_wifi_lora_32_V3.menu.EraseFlash.none=Disabled
heltec_wifi_lora_32_V3.menu.EraseFlash.none.upload.erase_cmd=
heltec_wifi_lora_32_V3.menu.EraseFlash.all=Enabled
heltec_wifi_lora_32_V3.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

heltec_wifi_lora_32_V4.name=Heltec WiFi LoRa 32(V4)

heltec_wifi_lora_32_V4.bootloader.tool=esptool_py
heltec_wifi_lora_32_V4.bootloader.tool.default=esptool_py

heltec_wifi_lora_32_V4.upload.tool=esptool_py
heltec_wifi_lora_32_V4.upload.tool.default=esptool_py
heltec_wifi_lora_32_V4.upload.tool.network=esp_ota

heltec_wifi_lora_32_V4.upload.maximum_size=1310720
heltec_wifi_lora_32_V4.upload.maximum_data_size=327680
heltec_wifi_lora_32_V4.upload.flags=
heltec_wifi_lora_32_V4.upload.extra_flags=
heltec_wifi_lora_32_V4.upload.use_1200bps_touch=false
heltec_wifi_lora_32_V4.upload.wait_for_upload_port=false

heltec_wifi_lora_32_V4.serial.disableDTR=false
heltec_wifi_lora_32_V4.serial.disableRTS=false

heltec_wifi_lora_32_V4.build.tarch=xtensa
heltec_wifi_lora_32_V4.build.bootloader_addr=0x0
heltec_wifi_lora_32_V4.build.target=esp32s3
heltec_wifi_lora_32_V4.build.mcu=esp32s3
heltec_wifi_lora_32_V4.build.core=esp32
heltec_wifi_lora_32_V4.build.variant=heltec_wifi_lora_32_V4
heltec_wifi_lora_32_V4.build.board=HELTEC_WIFI_LORA_32_V4

heltec_wifi_lora_32_V4.build.usb_mode=1
heltec_wifi_lora_32_V4.build.cdc_on_boot=0
heltec_wifi_lora_32_V4.build.msc_on_boot=0
heltec_wifi_lora_32_V4.build.dfu_on_boot=0
heltec_wifi_lora_32_V4.build.f_cpu=240000000L
heltec_wifi_lora_32_V4.build.flash_size=4MB
heltec_wifi_lora_32_V4.build.flash_freq=80m
heltec_wifi_lora_32_V4.build.flash_mode=dio
heltec_wifi_lora_32_V4.build.boot=qio
heltec_wifi_lora_32_V4.build.boot_freq=80m
heltec_wifi_lora_32_V4.build.partitions=default
heltec_wifi_lora_32_V4.build.defines=-D{build.band} -DMCU_ESP32_S3 -DHELTEC_BOARD=30 -DSLOW_CLK_TPYE=0 -DWIFI_LORA_32_V4 -DRADIO_CHIP_SX1262  -DLoRaWAN_DEBUG_LEVEL={build.LoRaWanDebugLevel} -DACTIVE_REGION=LORAMAC_{build.band} -DLORAWAN_PREAMBLE_LENGTH={build.LORAWAN_PREAMBLE_LENGTH} -DLORAWAN_DEVEUI_AUTO={build.LORAWAN_DEVEUI_AUTO} -DLORA_RX_LNA={build.LORA_RX_LNA} -D{build.LORA_FEM_TYPE} -D{build.board} {build.psram_val}
heltec_wifi_lora_32_V4.build.loop_core=
heltec_wifi_lora_32_V4.build.event_core=
heltec_wifi_lora_32_V4.build.psram_type=qspi
heltec_wifi_lora_32_V4.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
heltec_wifi_lora_32_V4.menu.JTAGAdapter.default=Disabled
heltec_wifi_lora_32_V4.menu.JTAGAdapter.default.build.copy_jtag_files=0
heltec_wifi_lora_32_V4.menu.JTAGAdapter.builtin=Integrated USB JTAG
heltec_wifi_lora_32_V4.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
heltec_wifi_lora_32_V4.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
heltec_wifi_lora_32_V4.menu.JTAGAdapter.external=FTDI Adapter
heltec_wifi_lora_32_V4.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
heltec_wifi_lora_32_V4.menu.JTAGAdapter.external.build.copy_jtag_files=1
heltec_wifi_lora_32_V4.menu.JTAGAdapter.bridge=ESP USB Bridge
heltec_wifi_lora_32_V4.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
heltec_wifi_lora_32_V4.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

heltec_wifi_lora_32_V4.menu.PSRAM.disabled=Disabled
heltec_wifi_lora_32_V4.menu.PSRAM.disabled.build.psram_val=
heltec_wifi_lora_32_V4.menu.PSRAM.disabled.build.psram_type=qspi
heltec_wifi_lora_32_V4.menu.PSRAM.enabled=QSPI PSRAM
heltec_wifi_lora_32_V4.menu.PSRAM.enabled.build.psram_val=-DBOARD_HAS_PSRAM
heltec_wifi_lora_32_V4.menu.PSRAM.enabled.build.psram_type=qspi

heltec_wifi_lora_32_V4.menu.FlashMode.qio=QIO 80MHz
heltec_wifi_lora_32_V4.menu.FlashMode.qio.build.flash_mode=dio
heltec_wifi_lora_32_V4.menu.FlashMode.qio.build.boot=qio
heltec_wifi_lora_32_V4.menu.FlashMode.qio.build.boot_freq=80m
heltec_wifi_lora_32_V4.menu.FlashMode.qio.build.flash_freq=80m
heltec_wifi_lora_32_V4.menu.FlashMode.qio120=QIO 120MHz
heltec_wifi_lora_32_V4.menu.FlashMode.qio120.build.flash_mode=dio
heltec_wifi_lora_32_V4.menu.FlashMode.qio120.build.boot=qio
heltec_wifi_lora_32_V4.menu.FlashMode.qio120.build.boot_freq=120m
heltec_wifi_lora_32_V4.menu.FlashMode.qio120.build.flash_freq=80m
heltec_wifi_lora_32_V4.menu.FlashMode.dio=DIO 80MHz
heltec_wifi_lora_32_V4.menu.FlashMode.dio.build.flash_mode=dio
heltec_wifi_lora_32_V4.menu.FlashMode.dio.build.boot=dio
heltec_wifi_lora_32_V4.menu.FlashMode.dio.build.boot_freq=80m
heltec_wifi_lora_32_V4.menu.FlashMode.dio.build.flash_freq=80m

heltec_wifi_lora_32_V4.menu.FlashSize.16M=16MB (128Mb)
heltec_wifi_lora_32_V4.menu.FlashSize.16M.build.flash_size=16MB

heltec_wifi_lora_32_V4.menu.LoopCore.1=Core 1
heltec_wifi_lora_32_V4.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
heltec_wifi_lora_32_V4.menu.LoopCore.0=Core 0
heltec_wifi_lora_32_V4.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

heltec_wifi_lora_32_V4.menu.EventsCore.1=Core 1
heltec_wifi_lora_32_V4.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
heltec_wifi_lora_32_V4.menu.EventsCore.0=Core 0
heltec_wifi_lora_32_V4.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

heltec_wifi_lora_32_V4.menu.USBMode.hwcdc=Hardware CDC and JTAG
heltec_wifi_lora_32_V4.menu.USBMode.hwcdc.build.usb_mode=1
heltec_wifi_lora_32_V4.menu.USBMode.default=USB-OTG (TinyUSB)
heltec_wifi_lora_32_V4.menu.USBMode.default.build.usb_mode=0

heltec_wifi_lora_32_V4.menu.CDCOnBoot.default=Disabled
heltec_wifi_lora_32_V4.menu.CDCOnBoot.default.build.cdc_on_boot=0
heltec_wifi_lora_32_V4.menu.CDCOnBoot.cdc=Enabled
heltec_wifi_lora_32_V4.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

