Heltec-Aaron-Lee/WiFi_Kit_series/boards.txt
heltec_wireless_paper.name=Heltec Wireless Paper

heltec_wireless_paper.bootloader.tool=esptool_py
heltec_wireless_paper.bootloader.tool.default=esptool_py

heltec_wireless_paper.upload.tool=esptool_py
heltec_wireless_paper.upload.tool.default=esptool_py
heltec_wireless_paper.upload.tool.network=esp_ota

heltec_wireless_paper.upload.maximum_size=4026368
heltec_wireless_paper.upload.maximum_data_size=327680
heltec_wireless_paper.upload.flags=
heltec_wireless_paper.upload.extra_flags=
heltec_wireless_paper.upload.use_1200bps_touch=false
heltec_wireless_paper.upload.wait_for_upload_port=false

heltec_wireless_paper.serial.disableDTR=false
heltec_wireless_paper.serial.disableRTS=false

heltec_wireless_paper.build.tarch=xtensa
heltec_wireless_paper.build.bootloader_addr=0x0
heltec_wireless_paper.build.target=esp32s3
heltec_wireless_paper.build.mcu=esp32s3
heltec_wireless_paper.build.core=esp32
heltec_wireless_paper.build.variant=heltec_wireless_paper
heltec_wireless_paper.build.board=HELTEC_WIRELESS_PAPER

heltec_wireless_paper.build.usb_mode=1
heltec_wireless_paper.build.cdc_on_boot=0
heltec_wireless_paper.build.msc_on_boot=0
heltec_wireless_paper.build.dfu_on_boot=0
heltec_wireless_paper.build.f_cpu=240000000L
heltec_wireless_paper.build.flash_size=8MB
heltec_wireless_paper.build.flash_freq=80m
heltec_wireless_paper.build.flash_mode=dio
heltec_wireless_paper.build.boot=qio
heltec_wireless_paper.build.boot_freq=80m
heltec_wireless_paper.build.partitions=default_8MB
heltec_wireless_paper.build.loop_core=
heltec_wireless_paper.build.event_core=
heltec_wireless_paper.build.psram_type=qspi
heltec_wireless_paper.build.memory_type={build.boot}_{build.psram_type}

heltec_wireless_paper.menu.LoopCore.1=Core 1
heltec_wireless_paper.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
heltec_wireless_paper.menu.LoopCore.0=Core 0
heltec_wireless_paper.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

heltec_wireless_paper.menu.EventsCore.1=Core 1
heltec_wireless_paper.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
heltec_wireless_paper.menu.EventsCore.0=Core 0
heltec_wireless_paper.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

heltec_wireless_paper.menu.CPUFreq.240=240MHz (WiFi)
heltec_wireless_paper.menu.CPUFreq.240.build.f_cpu=240000000L
heltec_wireless_paper.menu.CPUFreq.160=160MHz (WiFi)
heltec_wireless_paper.menu.CPUFreq.160.build.f_cpu=160000000L
heltec_wireless_paper.menu.CPUFreq.80=80MHz (WiFi)
heltec_wireless_paper.menu.CPUFreq.80.build.f_cpu=80000000L
heltec_wireless_paper.menu.CPUFreq.40=40MHz
heltec_wireless_paper.menu.CPUFreq.40.build.f_cpu=40000000L
heltec_wireless_paper.menu.CPUFreq.20=20MHz
heltec_wireless_paper.menu.CPUFreq.20.build.f_cpu=20000000L
heltec_wireless_paper.menu.CPUFreq.10=10MHz
heltec_wireless_paper.menu.CPUFreq.10.build.f_cpu=10000000L

heltec_wireless_paper.menu.UploadSpeed.921600=921600
heltec_wireless_paper.menu.UploadSpeed.921600.upload.speed=921600
heltec_wireless_paper.menu.UploadSpeed.115200=115200
heltec_wireless_paper.menu.UploadSpeed.115200.upload.speed=115200
heltec_wireless_paper.menu.UploadSpeed.256000.windows=256000
heltec_wireless_paper.menu.UploadSpeed.256000.upload.speed=256000
heltec_wireless_paper.menu.UploadSpeed.230400.windows.upload.speed=256000
heltec_wireless_paper.menu.UploadSpeed.230400=230400
heltec_wireless_paper.menu.UploadSpeed.230400.upload.speed=230400
heltec_wireless_paper.menu.UploadSpeed.460800.linux=460800
heltec_wireless_paper.menu.UploadSpeed.460800.macosx=460800
heltec_wireless_paper.menu.UploadSpeed.460800.upload.speed=460800
heltec_wireless_paper.menu.UploadSpeed.512000.windows=512000
heltec_wireless_paper.menu.UploadSpeed.512000.upload.speed=512000

heltec_wireless_paper.menu.DebugLevel.none=None
heltec_wireless_paper.menu.DebugLevel.none.build.code_debug=0
heltec_wireless_paper.menu.DebugLevel.error=Error
heltec_wireless_paper.menu.DebugLevel.error.build.code_debug=1
heltec_wireless_paper.menu.DebugLevel.warn=Warn
heltec_wireless_paper.menu.DebugLevel.warn.build.code_debug=2
heltec_wireless_paper.menu.DebugLevel.info=Info
heltec_wireless_paper.menu.DebugLevel.info.build.code_debug=3
heltec_wireless_paper.menu.DebugLevel.debug=Debug
heltec_wireless_paper.menu.DebugLevel.debug.build.code_debug=4
heltec_wireless_paper.menu.DebugLevel.verbose=Verbose
heltec_wireless_paper.menu.DebugLevel.verbose.build.code_debug=5

heltec_wireless_paper.menu.LORAWAN_REGION.0=REGION_EU868
heltec_wireless_paper.menu.LORAWAN_REGION.0.build.band=REGION_EU868
heltec_wireless_paper.menu.LORAWAN_REGION.1=REGION_EU433
heltec_wireless_paper.menu.LORAWAN_REGION.1.build.band=REGION_EU433
heltec_wireless_paper.menu.LORAWAN_REGION.2=REGION_CN470
heltec_wireless_paper.menu.LORAWAN_REGION.2.build.band=REGION_CN470
heltec_wireless_paper.menu.LORAWAN_REGION.3=REGION_US915
heltec_wireless_paper.menu.LORAWAN_REGION.3.build.band=REGION_US915
heltec_wireless_paper.menu.LORAWAN_REGION.4=REGION_AU915
heltec_wireless_paper.menu.LORAWAN_REGION.4.build.band=REGION_AU915
heltec_wireless_paper.menu.LORAWAN_REGION.5=REGION_CN779
heltec_wireless_paper.menu.LORAWAN_REGION.5.build.band=REGION_CN779
heltec_wireless_paper.menu.LORAWAN_REGION.6=REGION_AS923
heltec_wireless_paper.menu.LORAWAN_REGION.6.build.band=REGION_AS923
heltec_wireless_paper.menu.LORAWAN_REGION.7=REGION_KR920
heltec_wireless_paper.menu.LORAWAN_REGION.7.build.band=REGION_KR920
heltec_wireless_paper.menu.LORAWAN_REGION.8=REGION_IN865
heltec_wireless_paper.menu.LORAWAN_REGION.8.build.band=REGION_IN865
heltec_wireless_paper.menu.LORAWAN_REGION.9=REGION_US915_HYBRID
heltec_wireless_paper.menu.LORAWAN_REGION.9.build.band=REGION_US915_HYBRID

heltec_wireless_paper.menu.LoRaWanDebugLevel.0=None
heltec_wireless_paper.menu.LoRaWanDebugLevel.0.build.LoRaWanDebugLevel=0
heltec_wireless_paper.menu.LoRaWanDebugLevel.1=Freq
heltec_wireless_paper.menu.LoRaWanDebugLevel.1.build.LoRaWanDebugLevel=1
heltec_wireless_paper.menu.LoRaWanDebugLevel.2=Freq && DIO
heltec_wireless_paper.menu.LoRaWanDebugLevel.2.build.LoRaWanDebugLevel=2
heltec_wireless_paper.menu.LoRaWanDebugLevel.3=Freq && DIO && PW
heltec_wireless_paper.menu.LoRaWanDebugLevel.3.build.LoRaWanDebugLevel=3

heltec_wireless_paper.menu.LORAWAN_DEVEUI.0=CUSTOM
heltec_wireless_paper.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
heltec_wireless_paper.menu.LORAWAN_DEVEUI.1=Generate By ChipID
heltec_wireless_paper.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

heltec_wireless_paper.menu.LORAWAN_PREAMBLE_LENGTH.0=8(default)
heltec_wireless_paper.menu.LORAWAN_PREAMBLE_LENGTH.0.build.LORAWAN_PREAMBLE_LENGTH=8
heltec_wireless_paper.menu.LORAWAN_PREAMBLE_LENGTH.1=16(For M00 and M00L)
heltec_wireless_paper.menu.LORAWAN_PREAMBLE_LENGTH.1.build.LORAWAN_PREAMBLE_LENGTH=16

