Heltec-Aaron-Lee/WiFi_Kit_series/boards.txt
heltec_wireless_tracker.menu.LORAWAN_REGION.0=REGION_EU868
heltec_wireless_tracker.menu.LORAWAN_REGION.0.build.band=REGION_EU868
heltec_wireless_tracker.menu.LORAWAN_REGION.1=REGION_EU433
heltec_wireless_tracker.menu.LORAWAN_REGION.1.build.band=REGION_EU433
heltec_wireless_tracker.menu.LORAWAN_REGION.2=REGION_CN470
heltec_wireless_tracker.menu.LORAWAN_REGION.2.build.band=REGION_CN470
heltec_wireless_tracker.menu.LORAWAN_REGION.3=REGION_US915
heltec_wireless_tracker.menu.LORAWAN_REGION.3.build.band=REGION_US915
heltec_wireless_tracker.menu.LORAWAN_REGION.4=REGION_AU915
heltec_wireless_tracker.menu.LORAWAN_REGION.4.build.band=REGION_AU915
heltec_wireless_tracker.menu.LORAWAN_REGION.5=REGION_CN779
heltec_wireless_tracker.menu.LORAWAN_REGION.5.build.band=REGION_CN779
heltec_wireless_tracker.menu.LORAWAN_REGION.6=REGION_AS923
heltec_wireless_tracker.menu.LORAWAN_REGION.6.build.band=REGION_AS923
heltec_wireless_tracker.menu.LORAWAN_REGION.7=REGION_KR920
heltec_wireless_tracker.menu.LORAWAN_REGION.7.build.band=REGION_KR920
heltec_wireless_tracker.menu.LORAWAN_REGION.8=REGION_IN865
heltec_wireless_tracker.menu.LORAWAN_REGION.8.build.band=REGION_IN865
heltec_wireless_tracker.menu.LORAWAN_REGION.9=REGION_US915_HYBRID
heltec_wireless_tracker.menu.LORAWAN_REGION.9.build.band=REGION_US915_HYBRID

heltec_wireless_tracker.menu.LoRaWanDebugLevel.0=None
heltec_wireless_tracker.menu.LoRaWanDebugLevel.0.build.LoRaWanDebugLevel=0
heltec_wireless_tracker.menu.LoRaWanDebugLevel.1=Freq
heltec_wireless_tracker.menu.LoRaWanDebugLevel.1.build.LoRaWanDebugLevel=1
heltec_wireless_tracker.menu.LoRaWanDebugLevel.2=Freq && DIO
heltec_wireless_tracker.menu.LoRaWanDebugLevel.2.build.LoRaWanDebugLevel=2
heltec_wireless_tracker.menu.LoRaWanDebugLevel.3=Freq && DIO && PW
heltec_wireless_tracker.menu.LoRaWanDebugLevel.3.build.LoRaWanDebugLevel=3

heltec_wireless_tracker.menu.LORAWAN_DEVEUI.0=CUSTOM
heltec_wireless_tracker.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
heltec_wireless_tracker.menu.LORAWAN_DEVEUI.1=Generate By ChipID
heltec_wireless_tracker.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

heltec_wireless_tracker.menu.LORAWAN_PREAMBLE_LENGTH.0=8(default)
heltec_wireless_tracker.menu.LORAWAN_PREAMBLE_LENGTH.0.build.LORAWAN_PREAMBLE_LENGTH=8
heltec_wireless_tracker.menu.LORAWAN_PREAMBLE_LENGTH.1=16(For M00 and M00L)
heltec_wireless_tracker.menu.LORAWAN_PREAMBLE_LENGTH.1.build.LORAWAN_PREAMBLE_LENGTH=16

heltec_wireless_tracker.menu.SLOW_CLK_TPYE.0=Internal (default)
heltec_wireless_tracker.menu.SLOW_CLK_TPYE.0.build.SLOW_CLK_TPYE=0
heltec_wireless_tracker.menu.SLOW_CLK_TPYE.1=External 32K
heltec_wireless_tracker.menu.SLOW_CLK_TPYE.1.build.SLOW_CLK_TPYE=1

heltec_wireless_tracker.build.defines=-D{build.band}  -DMCU_ESP32_S3 -DHELTEC_BOARD=34 -DWIRELESS_TRACKER -DSLOW_CLK_TPYE={build.SLOW_CLK_TPYE} -DRADIO_CHIP_SX1262  -DLoRaWAN_DEBUG_LEVEL={build.LoRaWanDebugLevel} -DACTIVE_REGION=LORAMAC_{build.band} -DLORAWAN_PREAMBLE_LENGTH={build.LORAWAN_PREAMBLE_LENGTH} -DLORAWAN_DEVEUI_AUTO={build.LORAWAN_DEVEUI_AUTO} -D{build.board}

heltec_wireless_tracker.menu.EraseFlash.none=Disabled
heltec_wireless_tracker.menu.EraseFlash.none.upload.erase_cmd=
heltec_wireless_tracker.menu.EraseFlash.all=Enabled
heltec_wireless_tracker.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
heltec_wireless_tracker_v2.name=Heltec Wireless Tracker(V2)

heltec_wireless_tracker_v2.bootloader.tool=esptool_py
heltec_wireless_tracker_v2.bootloader.tool.default=esptool_py

heltec_wireless_tracker_v2.upload.tool=esptool_py
heltec_wireless_tracker_v2.upload.tool.default=esptool_py
heltec_wireless_tracker_v2.upload.tool.network=esp_ota

heltec_wireless_tracker_v2.upload.maximum_size=3342336
heltec_wireless_tracker_v2.upload.maximum_data_size=327680
heltec_wireless_tracker_v2.upload.flags=
heltec_wireless_tracker_v2.upload.extra_flags=
heltec_wireless_tracker_v2.upload.use_1200bps_touch=false
heltec_wireless_tracker_v2.upload.wait_for_upload_port=false

heltec_wireless_tracker_v2.serial.disableDTR=false
heltec_wireless_tracker_v2.serial.disableRTS=false

heltec_wireless_tracker_v2.build.tarch=xtensa
heltec_wireless_tracker_v2.build.bootloader_addr=0x0
heltec_wireless_tracker_v2.build.target=esp32s3
heltec_wireless_tracker_v2.build.mcu=esp32s3
heltec_wireless_tracker_v2.build.core=esp32
heltec_wireless_tracker_v2.build.variant=heltec_wireless_tracker_v2
heltec_wireless_tracker_v2.build.board=HELTEC_WIRELESS_TRACKER_V2

heltec_wireless_tracker_v2.build.usb_mode=1
heltec_wireless_tracker_v2.build.cdc_on_boot=0
heltec_wireless_tracker_v2.build.msc_on_boot=0
heltec_wireless_tracker_v2.build.dfu_on_boot=0
heltec_wireless_tracker_v2.build.f_cpu=240000000L
heltec_wireless_tracker_v2.build.flash_size=8MB
heltec_wireless_tracker_v2.build.flash_freq=80m
heltec_wireless_tracker_v2.build.flash_mode=dio
heltec_wireless_tracker_v2.build.boot=qio
heltec_wireless_tracker_v2.build.boot_freq=80m
heltec_wireless_tracker_v2.build.partitions=default_8MB
heltec_wireless_tracker_v2.build.defines=-D{build.band}  -DMCU_ESP32_S3 -DHELTEC_BOARD=34 -DWIRELESS_TRACKER_V2 -DSLOW_CLK_TPYE={build.SLOW_CLK_TPYE} -DRADIO_CHIP_SX1262  -DLoRaWAN_DEBUG_LEVEL={build.LoRaWanDebugLevel} -DACTIVE_REGION=LORAMAC_{build.band} -DLORAWAN_PREAMBLE_LENGTH={build.LORAWAN_PREAMBLE_LENGTH} -DLORAWAN_DEVEUI_AUTO={build.LORAWAN_DEVEUI_AUTO} -DLORA_RX_LNA={build.LORA_RX_LNA} -D{build.LORA_FEM_TYPE} -D{build.board}
heltec_wireless_tracker_v2.build.loop_core=
heltec_wireless_tracker_v2.build.event_core=
heltec_wireless_tracker_v2.build.psram_type=qspi
heltec_wireless_tracker_v2.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
heltec_wireless_tracker_v2.menu.JTAGAdapter.default=Disabled
heltec_wireless_tracker_v2.menu.JTAGAdapter.default.build.copy_jtag_files=0
heltec_wireless_tracker_v2.menu.JTAGAdapter.builtin=Integrated USB JTAG
heltec_wireless_tracker_v2.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
heltec_wireless_tracker_v2.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
heltec_wireless_tracker_v2.menu.JTAGAdapter.external=FTDI Adapter
heltec_wireless_tracker_v2.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
heltec_wireless_tracker_v2.menu.JTAGAdapter.external.build.copy_jtag_files=1
heltec_wireless_tracker_v2.menu.JTAGAdapter.bridge=ESP USB Bridge
heltec_wireless_tracker_v2.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
heltec_wireless_tracker_v2.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

