Heltec-Aaron-Lee/WiFi_Kit_series/boards.txt
heltec_wireless_tracker_v2.menu.UploadSpeed.921600=921600
heltec_wireless_tracker_v2.menu.UploadSpeed.921600.upload.speed=921600
heltec_wireless_tracker_v2.menu.UploadSpeed.115200=115200
heltec_wireless_tracker_v2.menu.UploadSpeed.115200.upload.speed=115200
heltec_wireless_tracker_v2.menu.UploadSpeed.256000.windows=256000
heltec_wireless_tracker_v2.menu.UploadSpeed.256000.upload.speed=256000
heltec_wireless_tracker_v2.menu.UploadSpeed.230400.windows.upload.speed=256000
heltec_wireless_tracker_v2.menu.UploadSpeed.230400=230400
heltec_wireless_tracker_v2.menu.UploadSpeed.230400.upload.speed=230400
heltec_wireless_tracker_v2.menu.UploadSpeed.460800.linux=460800
heltec_wireless_tracker_v2.menu.UploadSpeed.460800.macosx=460800
heltec_wireless_tracker_v2.menu.UploadSpeed.460800.upload.speed=460800
heltec_wireless_tracker_v2.menu.UploadSpeed.512000.windows=512000
heltec_wireless_tracker_v2.menu.UploadSpeed.512000.upload.speed=512000

heltec_wireless_tracker_v2.menu.DebugLevel.none=None
heltec_wireless_tracker_v2.menu.DebugLevel.none.build.code_debug=0
heltec_wireless_tracker_v2.menu.DebugLevel.error=Error
heltec_wireless_tracker_v2.menu.DebugLevel.error.build.code_debug=1
heltec_wireless_tracker_v2.menu.DebugLevel.warn=Warn
heltec_wireless_tracker_v2.menu.DebugLevel.warn.build.code_debug=2
heltec_wireless_tracker_v2.menu.DebugLevel.info=Info
heltec_wireless_tracker_v2.menu.DebugLevel.info.build.code_debug=3
heltec_wireless_tracker_v2.menu.DebugLevel.debug=Debug
heltec_wireless_tracker_v2.menu.DebugLevel.debug.build.code_debug=4
heltec_wireless_tracker_v2.menu.DebugLevel.verbose=Verbose
heltec_wireless_tracker_v2.menu.DebugLevel.verbose.build.code_debug=5

heltec_wireless_tracker_v2.menu.LORAWAN_REGION.0=REGION_EU868
heltec_wireless_tracker_v2.menu.LORAWAN_REGION.0.build.band=REGION_EU868
heltec_wireless_tracker_v2.menu.LORAWAN_REGION.1=REGION_EU433
heltec_wireless_tracker_v2.menu.LORAWAN_REGION.1.build.band=REGION_EU433
heltec_wireless_tracker_v2.menu.LORAWAN_REGION.2=REGION_CN470
heltec_wireless_tracker_v2.menu.LORAWAN_REGION.2.build.band=REGION_CN470
heltec_wireless_tracker_v2.menu.LORAWAN_REGION.3=REGION_US915
heltec_wireless_tracker_v2.menu.LORAWAN_REGION.3.build.band=REGION_US915
heltec_wireless_tracker_v2.menu.LORAWAN_REGION.4=REGION_AU915
heltec_wireless_tracker_v2.menu.LORAWAN_REGION.4.build.band=REGION_AU915
heltec_wireless_tracker_v2.menu.LORAWAN_REGION.5=REGION_CN779
heltec_wireless_tracker_v2.menu.LORAWAN_REGION.5.build.band=REGION_CN779
heltec_wireless_tracker_v2.menu.LORAWAN_REGION.6=REGION_AS923
heltec_wireless_tracker_v2.menu.LORAWAN_REGION.6.build.band=REGION_AS923
heltec_wireless_tracker_v2.menu.LORAWAN_REGION.7=REGION_KR920
heltec_wireless_tracker_v2.menu.LORAWAN_REGION.7.build.band=REGION_KR920
heltec_wireless_tracker_v2.menu.LORAWAN_REGION.8=REGION_IN865
heltec_wireless_tracker_v2.menu.LORAWAN_REGION.8.build.band=REGION_IN865
heltec_wireless_tracker_v2.menu.LORAWAN_REGION.9=REGION_US915_HYBRID
heltec_wireless_tracker_v2.menu.LORAWAN_REGION.9.build.band=REGION_US915_HYBRID

heltec_wireless_tracker_v2.menu.LoRaWanDebugLevel.0=None
heltec_wireless_tracker_v2.menu.LoRaWanDebugLevel.0.build.LoRaWanDebugLevel=0
heltec_wireless_tracker_v2.menu.LoRaWanDebugLevel.1=Freq
heltec_wireless_tracker_v2.menu.LoRaWanDebugLevel.1.build.LoRaWanDebugLevel=1
heltec_wireless_tracker_v2.menu.LoRaWanDebugLevel.2=Freq && DIO
heltec_wireless_tracker_v2.menu.LoRaWanDebugLevel.2.build.LoRaWanDebugLevel=2
heltec_wireless_tracker_v2.menu.LoRaWanDebugLevel.3=Freq && DIO && PW
heltec_wireless_tracker_v2.menu.LoRaWanDebugLevel.3.build.LoRaWanDebugLevel=3

heltec_wireless_tracker_v2.menu.LORAWAN_DEVEUI.0=CUSTOM
heltec_wireless_tracker_v2.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
heltec_wireless_tracker_v2.menu.LORAWAN_DEVEUI.1=Generate By ChipID
heltec_wireless_tracker_v2.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

heltec_wireless_tracker_v2.menu.LORAWAN_PREAMBLE_LENGTH.0=8(default)
heltec_wireless_tracker_v2.menu.LORAWAN_PREAMBLE_LENGTH.0.build.LORAWAN_PREAMBLE_LENGTH=8
heltec_wireless_tracker_v2.menu.LORAWAN_PREAMBLE_LENGTH.1=16(For M00 and M00L)
heltec_wireless_tracker_v2.menu.LORAWAN_PREAMBLE_LENGTH.1.build.LORAWAN_PREAMBLE_LENGTH=16

heltec_wireless_tracker_v2.menu.LORA_FEM_TYPE.0=USE_KCT8103L_PA (default)
heltec_wireless_tracker_v2.menu.LORA_FEM_TYPE.0.build.LORA_FEM_TYPE=USE_KCT8103L_PA

heltec_wireless_tracker_v2.menu.LORA_RX_LNA.0=Disabled (default)
heltec_wireless_tracker_v2.menu.LORA_RX_LNA.0.build.LORA_RX_LNA=1
heltec_wireless_tracker_v2.menu.LORA_RX_LNA.1=Enabled
heltec_wireless_tracker_v2.menu.LORA_RX_LNA.1.build.LORA_RX_LNA=0

heltec_wireless_tracker_v2.menu.SLOW_CLK_TPYE.0=Internal (default)
heltec_wireless_tracker_v2.menu.SLOW_CLK_TPYE.0.build.SLOW_CLK_TPYE=0
heltec_wireless_tracker_v2.menu.SLOW_CLK_TPYE.1=External 32K
heltec_wireless_tracker_v2.menu.SLOW_CLK_TPYE.1.build.SLOW_CLK_TPYE=1

heltec_wireless_tracker_v2.menu.EraseFlash.none=Disabled
heltec_wireless_tracker_v2.menu.EraseFlash.none.upload.erase_cmd=
heltec_wireless_tracker_v2.menu.EraseFlash.all=Enabled
heltec_wireless_tracker_v2.menu.EraseFlash.all.upload.erase_cmd=-e

heltec_wireless_tracker_v2.menu.ZigbeeMode.default=Disabled
heltec_wireless_tracker_v2.menu.ZigbeeMode.default.build.zigbee_mode=
heltec_wireless_tracker_v2.menu.ZigbeeMode.default.build.zigbee_libs=
heltec_wireless_tracker_v2.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
heltec_wireless_tracker_v2.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
heltec_wireless_tracker_v2.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote

##############################################################

heltec_wireless_mini_shell.name=Heltec Wireless Mini Shell

heltec_wireless_mini_shell.bootloader.tool=esptool_py
heltec_wireless_mini_shell.bootloader.tool.default=esptool_py

heltec_wireless_mini_shell.upload.tool=esptool_py
heltec_wireless_mini_shell.upload.tool.default=esptool_py
heltec_wireless_mini_shell.upload.tool.network=esp_ota

