Heltec-Aaron-Lee/WiFi_Kit_series/boards.txt
heltec_ht_de01.build.tarch=xtensa
heltec_ht_de01.build.bootloader_addr=0x0
heltec_ht_de01.build.target=esp32s3
heltec_ht_de01.build.mcu=esp32s3
heltec_ht_de01.build.core=esp32
heltec_ht_de01.build.variant=heltec_ht_de01
heltec_ht_de01.build.board=HT_DE01

heltec_ht_de01.build.usb_mode=1
heltec_ht_de01.build.cdc_on_boot=0
heltec_ht_de01.build.msc_on_boot=0
heltec_ht_de01.build.dfu_on_boot=0
heltec_ht_de01.build.f_cpu=240000000L
heltec_ht_de01.build.flash_size=8MB
heltec_ht_de01.build.flash_freq=80m
heltec_ht_de01.build.flash_mode=dio
heltec_ht_de01.build.boot=qio
heltec_ht_de01.build.boot_freq=80m
heltec_ht_de01.build.partitions=default_8MB
heltec_ht_de01.build.loop_core=
heltec_ht_de01.build.event_core=
heltec_ht_de01.build.psram_type=qspi
heltec_ht_de01.build.memory_type={build.boot}_{build.psram_type}

heltec_ht_de01.menu.LoopCore.1=Core 1
heltec_ht_de01.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
heltec_ht_de01.menu.LoopCore.0=Core 0
heltec_ht_de01.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

heltec_ht_de01.menu.EventsCore.1=Core 1
heltec_ht_de01.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
heltec_ht_de01.menu.EventsCore.0=Core 0
heltec_ht_de01.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

heltec_ht_de01.menu.CPUFreq.240=240MHz (WiFi)
heltec_ht_de01.menu.CPUFreq.240.build.f_cpu=240000000L
heltec_ht_de01.menu.CPUFreq.160=160MHz (WiFi)
heltec_ht_de01.menu.CPUFreq.160.build.f_cpu=160000000L
heltec_ht_de01.menu.CPUFreq.80=80MHz (WiFi)
heltec_ht_de01.menu.CPUFreq.80.build.f_cpu=80000000L
heltec_ht_de01.menu.CPUFreq.40=40MHz
heltec_ht_de01.menu.CPUFreq.40.build.f_cpu=40000000L
heltec_ht_de01.menu.CPUFreq.20=20MHz
heltec_ht_de01.menu.CPUFreq.20.build.f_cpu=20000000L
heltec_ht_de01.menu.CPUFreq.10=10MHz
heltec_ht_de01.menu.CPUFreq.10.build.f_cpu=10000000L

heltec_ht_de01.menu.UploadSpeed.921600=921600
heltec_ht_de01.menu.UploadSpeed.921600.upload.speed=921600
heltec_ht_de01.menu.UploadSpeed.115200=115200
heltec_ht_de01.menu.UploadSpeed.115200.upload.speed=115200
heltec_ht_de01.menu.UploadSpeed.256000.windows=256000
heltec_ht_de01.menu.UploadSpeed.256000.upload.speed=256000
heltec_ht_de01.menu.UploadSpeed.230400.windows.upload.speed=256000
heltec_ht_de01.menu.UploadSpeed.230400=230400
heltec_ht_de01.menu.UploadSpeed.230400.upload.speed=230400
heltec_ht_de01.menu.UploadSpeed.460800.linux=460800
heltec_ht_de01.menu.UploadSpeed.460800.macosx=460800
heltec_ht_de01.menu.UploadSpeed.460800.upload.speed=460800
heltec_ht_de01.menu.UploadSpeed.512000.windows=512000
heltec_ht_de01.menu.UploadSpeed.512000.upload.speed=512000

heltec_ht_de01.menu.DebugLevel.none=None
heltec_ht_de01.menu.DebugLevel.none.build.code_debug=0
heltec_ht_de01.menu.DebugLevel.error=Error
heltec_ht_de01.menu.DebugLevel.error.build.code_debug=1
heltec_ht_de01.menu.DebugLevel.warn=Warn
heltec_ht_de01.menu.DebugLevel.warn.build.code_debug=2
heltec_ht_de01.menu.DebugLevel.info=Info
heltec_ht_de01.menu.DebugLevel.info.build.code_debug=3
heltec_ht_de01.menu.DebugLevel.debug=Debug
heltec_ht_de01.menu.DebugLevel.debug.build.code_debug=4
heltec_ht_de01.menu.DebugLevel.verbose=Verbose
heltec_ht_de01.menu.DebugLevel.verbose.build.code_debug=5

heltec_ht_de01.menu.einksize.0=eink_150
heltec_ht_de01.menu.einksize.0.build.einksize=150;
heltec_ht_de01.menu.einksize.1=eink_154
heltec_ht_de01.menu.einksize.1.build.einksize=154;
heltec_ht_de01.menu.einksize.2=eink_213
heltec_ht_de01.menu.einksize.2.build.einksize=213;
heltec_ht_de01.menu.einksize.3=eink_290
heltec_ht_de01.menu.einksize.3.build.einksize=290;

heltec_ht_de01.build.defines=   -DEINK={build.einksize}   -D{build.board}

heltec_ht_de01.menu.EraseFlash.none=Disabled
heltec_ht_de01.menu.EraseFlash.none.upload.erase_cmd=
heltec_ht_de01.menu.EraseFlash.all=Enabled
heltec_ht_de01.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

heltec_vision_master_e290.name=Heltec Vision Master E290

heltec_vision_master_e290.bootloader.tool=esptool_py
heltec_vision_master_e290.bootloader.tool.default=esptool_py

heltec_vision_master_e290.upload.tool=esptool_py
heltec_vision_master_e290.upload.tool.default=esptool_py
heltec_vision_master_e290.upload.tool.network=esp_ota

heltec_vision_master_e290.upload.maximum_size=3342336
heltec_vision_master_e290.upload.maximum_data_size=327680
heltec_vision_master_e290.upload.flags=
heltec_vision_master_e290.upload.extra_flags=
heltec_vision_master_e290.upload.use_1200bps_touch=false
heltec_vision_master_e290.upload.wait_for_upload_port=false

heltec_vision_master_e290.serial.disableDTR=false
heltec_vision_master_e290.serial.disableRTS=false

heltec_vision_master_e290.build.tarch=xtensa
heltec_vision_master_e290.build.bootloader_addr=0x0
heltec_vision_master_e290.build.target=esp32s3
heltec_vision_master_e290.build.mcu=esp32s3
heltec_vision_master_e290.build.core=esp32
heltec_vision_master_e290.build.variant=heltec_vision_master_e290
heltec_vision_master_e290.build.board=HELTEC_VISION_MASTER_E290

heltec_vision_master_e290.build.usb_mode=1
heltec_vision_master_e290.build.cdc_on_boot=0
heltec_vision_master_e290.build.msc_on_boot=0
heltec_vision_master_e290.build.dfu_on_boot=0
heltec_vision_master_e290.build.f_cpu=240000000L
heltec_vision_master_e290.build.flash_size=8MB
heltec_vision_master_e290.build.flash_freq=80m
heltec_vision_master_e290.build.flash_mode=dio
heltec_vision_master_e290.build.boot=qio
heltec_vision_master_e290.build.boot_freq=80m
heltec_vision_master_e290.build.partitions=default_8MB
heltec_vision_master_e290.build.loop_core=
heltec_vision_master_e290.build.event_core=
heltec_vision_master_e290.build.psram_type=qspi
heltec_vision_master_e290.build.memory_type={build.boot}_{build.psram_type}

heltec_vision_master_e290.menu.LoopCore.1=Core 1
heltec_vision_master_e290.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
heltec_vision_master_e290.menu.LoopCore.0=Core 0
heltec_vision_master_e290.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

heltec_vision_master_e290.menu.EventsCore.1=Core 1
heltec_vision_master_e290.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
heltec_vision_master_e290.menu.EventsCore.0=Core 0
heltec_vision_master_e290.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

