Heltec-Aaron-Lee/WiFi_Kit_series/boards.txt
heltec_radio_core_s3_r8.menu.CDCOnBoot.default=Enabled
heltec_radio_core_s3_r8.menu.CDCOnBoot.default.build.cdc_on_boot=1
heltec_radio_core_s3_r8.menu.CDCOnBoot.cdc=Disabled
heltec_radio_core_s3_r8.menu.CDCOnBoot.cdc.build.cdc_on_boot=0
heltec_radio_core_s3_r8.menu.MSCOnBoot.default=Disabled
heltec_radio_core_s3_r8.menu.MSCOnBoot.default.build.msc_on_boot=0
heltec_radio_core_s3_r8.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
heltec_radio_core_s3_r8.menu.MSCOnBoot.msc.build.msc_on_boot=1

heltec_radio_core_s3_r8.menu.DFUOnBoot.default=Disabled
heltec_radio_core_s3_r8.menu.DFUOnBoot.default.build.dfu_on_boot=0
heltec_radio_core_s3_r8.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
heltec_radio_core_s3_r8.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

heltec_radio_core_s3_r8.menu.UploadMode.default=UART0 / Hardware CDC
heltec_radio_core_s3_r8.menu.UploadMode.default.upload.use_1200bps_touch=false
heltec_radio_core_s3_r8.menu.UploadMode.default.upload.wait_for_upload_port=false
heltec_radio_core_s3_r8.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
heltec_radio_core_s3_r8.menu.UploadMode.cdc.upload.use_1200bps_touch=true
heltec_radio_core_s3_r8.menu.UploadMode.cdc.upload.wait_for_upload_port=true

heltec_radio_core_s3_r8.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
heltec_radio_core_s3_r8.menu.PartitionScheme.default.build.partitions=default
heltec_radio_core_s3_r8.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
heltec_radio_core_s3_r8.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
heltec_radio_core_s3_r8.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
heltec_radio_core_s3_r8.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
heltec_radio_core_s3_r8.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
heltec_radio_core_s3_r8.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
heltec_radio_core_s3_r8.menu.PartitionScheme.minimal.build.partitions=minimal
heltec_radio_core_s3_r8.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
heltec_radio_core_s3_r8.menu.PartitionScheme.no_fs.build.partitions=no_fs
heltec_radio_core_s3_r8.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
heltec_radio_core_s3_r8.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
heltec_radio_core_s3_r8.menu.PartitionScheme.no_ota.build.partitions=no_ota
heltec_radio_core_s3_r8.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
heltec_radio_core_s3_r8.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
heltec_radio_core_s3_r8.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
heltec_radio_core_s3_r8.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
heltec_radio_core_s3_r8.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
heltec_radio_core_s3_r8.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
heltec_radio_core_s3_r8.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
heltec_radio_core_s3_r8.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
heltec_radio_core_s3_r8.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
heltec_radio_core_s3_r8.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
heltec_radio_core_s3_r8.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
heltec_radio_core_s3_r8.menu.PartitionScheme.huge_app.build.partitions=huge_app
heltec_radio_core_s3_r8.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
heltec_radio_core_s3_r8.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
heltec_radio_core_s3_r8.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
heltec_radio_core_s3_r8.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
heltec_radio_core_s3_r8.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
heltec_radio_core_s3_r8.menu.PartitionScheme.fatflash.build.partitions=ffat
heltec_radio_core_s3_r8.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
heltec_radio_core_s3_r8.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
heltec_radio_core_s3_r8.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
heltec_radio_core_s3_r8.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
heltec_radio_core_s3_r8.menu.PartitionScheme.rainmaker=RainMaker 4MB
heltec_radio_core_s3_r8.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
heltec_radio_core_s3_r8.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
heltec_radio_core_s3_r8.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
heltec_radio_core_s3_r8.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
heltec_radio_core_s3_r8.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
heltec_radio_core_s3_r8.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
heltec_radio_core_s3_r8.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
heltec_radio_core_s3_r8.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000
heltec_radio_core_s3_r8.menu.PartitionScheme.esp_sr_16=ESP SR 16M (3MB APP/7MB SPIFFS/2.9MB MODEL)
heltec_radio_core_s3_r8.menu.PartitionScheme.esp_sr_16.upload.maximum_size=3145728
heltec_radio_core_s3_r8.menu.PartitionScheme.esp_sr_16.upload.extra_flags=0xD10000 {build.path}/srmodels.bin
heltec_radio_core_s3_r8.menu.PartitionScheme.esp_sr_16.build.partitions=esp_sr_16
heltec_radio_core_s3_r8.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
heltec_radio_core_s3_r8.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
heltec_radio_core_s3_r8.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
heltec_radio_core_s3_r8.menu.PartitionScheme.zigbee_zczr_8MB=Zigbee ZCZR 8MB with spiffs
heltec_radio_core_s3_r8.menu.PartitionScheme.zigbee_zczr_8MB.build.partitions=zigbee_zczr_8MB
heltec_radio_core_s3_r8.menu.PartitionScheme.zigbee_zczr_8MB.upload.maximum_size=3407872
heltec_radio_core_s3_r8.menu.PartitionScheme.custom=Custom
heltec_radio_core_s3_r8.menu.PartitionScheme.custom.build.partitions=
heltec_radio_core_s3_r8.menu.PartitionScheme.custom.upload.maximum_size=16777216

heltec_radio_core_s3_r8.menu.CPUFreq.240=240MHz (WiFi)
heltec_radio_core_s3_r8.menu.CPUFreq.240.build.f_cpu=240000000L
heltec_radio_core_s3_r8.menu.CPUFreq.160=160MHz (WiFi)
heltec_radio_core_s3_r8.menu.CPUFreq.160.build.f_cpu=160000000L
heltec_radio_core_s3_r8.menu.CPUFreq.80=80MHz (WiFi)
heltec_radio_core_s3_r8.menu.CPUFreq.80.build.f_cpu=80000000L
heltec_radio_core_s3_r8.menu.CPUFreq.40=40MHz
heltec_radio_core_s3_r8.menu.CPUFreq.40.build.f_cpu=40000000L
heltec_radio_core_s3_r8.menu.CPUFreq.20=20MHz
heltec_radio_core_s3_r8.menu.CPUFreq.20.build.f_cpu=20000000L
heltec_radio_core_s3_r8.menu.CPUFreq.10=10MHz
heltec_radio_core_s3_r8.menu.CPUFreq.10.build.f_cpu=10000000L

heltec_radio_core_s3_r8.menu.UploadSpeed.921600=921600
heltec_radio_core_s3_r8.menu.UploadSpeed.921600.upload.speed=921600
heltec_radio_core_s3_r8.menu.UploadSpeed.115200=115200
heltec_radio_core_s3_r8.menu.UploadSpeed.115200.upload.speed=115200
heltec_radio_core_s3_r8.menu.UploadSpeed.256000.windows=256000
heltec_radio_core_s3_r8.menu.UploadSpeed.256000.upload.speed=256000
heltec_radio_core_s3_r8.menu.UploadSpeed.230400.windows.upload.speed=256000
heltec_radio_core_s3_r8.menu.UploadSpeed.230400=230400
heltec_radio_core_s3_r8.menu.UploadSpeed.230400.upload.speed=230400
heltec_radio_core_s3_r8.menu.UploadSpeed.460800.linux=460800
heltec_radio_core_s3_r8.menu.UploadSpeed.460800.macosx=460800
heltec_radio_core_s3_r8.menu.UploadSpeed.460800.upload.speed=460800
heltec_radio_core_s3_r8.menu.UploadSpeed.512000.windows=512000
heltec_radio_core_s3_r8.menu.UploadSpeed.512000.upload.speed=512000

heltec_radio_core_s3_r8.menu.DebugLevel.none=None
heltec_radio_core_s3_r8.menu.DebugLevel.none.build.code_debug=0
heltec_radio_core_s3_r8.menu.DebugLevel.error=Error
heltec_radio_core_s3_r8.menu.DebugLevel.error.build.code_debug=1
heltec_radio_core_s3_r8.menu.DebugLevel.warn=Warn
heltec_radio_core_s3_r8.menu.DebugLevel.warn.build.code_debug=2
heltec_radio_core_s3_r8.menu.DebugLevel.info=Info
heltec_radio_core_s3_r8.menu.DebugLevel.info.build.code_debug=3
heltec_radio_core_s3_r8.menu.DebugLevel.debug=Debug
heltec_radio_core_s3_r8.menu.DebugLevel.debug.build.code_debug=4
heltec_radio_core_s3_r8.menu.DebugLevel.verbose=Verbose
heltec_radio_core_s3_r8.menu.DebugLevel.verbose.build.code_debug=5

heltec_radio_core_s3_r8.menu.LORAWAN_REGION.0=REGION_EU868
heltec_radio_core_s3_r8.menu.LORAWAN_REGION.0.build.band=REGION_EU868
heltec_radio_core_s3_r8.menu.LORAWAN_REGION.1=REGION_EU433
heltec_radio_core_s3_r8.menu.LORAWAN_REGION.1.build.band=REGION_EU433
heltec_radio_core_s3_r8.menu.LORAWAN_REGION.2=REGION_CN470
heltec_radio_core_s3_r8.menu.LORAWAN_REGION.2.build.band=REGION_CN470
heltec_radio_core_s3_r8.menu.LORAWAN_REGION.3=REGION_US915
heltec_radio_core_s3_r8.menu.LORAWAN_REGION.3.build.band=REGION_US915
heltec_radio_core_s3_r8.menu.LORAWAN_REGION.4=REGION_AU915
heltec_radio_core_s3_r8.menu.LORAWAN_REGION.4.build.band=REGION_AU915
heltec_radio_core_s3_r8.menu.LORAWAN_REGION.5=REGION_CN779
heltec_radio_core_s3_r8.menu.LORAWAN_REGION.5.build.band=REGION_CN779
heltec_radio_core_s3_r8.menu.LORAWAN_REGION.6=REGION_AS923
heltec_radio_core_s3_r8.menu.LORAWAN_REGION.6.build.band=REGION_AS923
heltec_radio_core_s3_r8.menu.LORAWAN_REGION.7=REGION_KR920
heltec_radio_core_s3_r8.menu.LORAWAN_REGION.7.build.band=REGION_KR920
heltec_radio_core_s3_r8.menu.LORAWAN_REGION.8=REGION_IN865
heltec_radio_core_s3_r8.menu.LORAWAN_REGION.8.build.band=REGION_IN865
heltec_radio_core_s3_r8.menu.LORAWAN_REGION.9=REGION_US915_HYBRID
heltec_radio_core_s3_r8.menu.LORAWAN_REGION.9.build.band=REGION_US915_HYBRID

heltec_radio_core_s3_r8.menu.LoRaWanDebugLevel.0=None
heltec_radio_core_s3_r8.menu.LoRaWanDebugLevel.0.build.LoRaWanDebugLevel=0
heltec_radio_core_s3_r8.menu.LoRaWanDebugLevel.1=Freq
heltec_radio_core_s3_r8.menu.LoRaWanDebugLevel.1.build.LoRaWanDebugLevel=1
heltec_radio_core_s3_r8.menu.LoRaWanDebugLevel.2=Freq && DIO
heltec_radio_core_s3_r8.menu.LoRaWanDebugLevel.2.build.LoRaWanDebugLevel=2
heltec_radio_core_s3_r8.menu.LoRaWanDebugLevel.3=Freq && DIO && PW
heltec_radio_core_s3_r8.menu.LoRaWanDebugLevel.3.build.LoRaWanDebugLevel=3

heltec_radio_core_s3_r8.menu.LORAWAN_DEVEUI.0=CUSTOM
heltec_radio_core_s3_r8.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
heltec_radio_core_s3_r8.menu.LORAWAN_DEVEUI.1=Generate By ChipID
heltec_radio_core_s3_r8.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

