Heltec-Aaron-Lee/WiFi_Kit_series/boards.txt
heltec_radio_core_s3_r8.menu.LORAWAN_PREAMBLE_LENGTH.0=8(default)
heltec_radio_core_s3_r8.menu.LORAWAN_PREAMBLE_LENGTH.0.build.LORAWAN_PREAMBLE_LENGTH=8
heltec_radio_core_s3_r8.menu.LORAWAN_PREAMBLE_LENGTH.1=16(For M00 and M00L)
heltec_radio_core_s3_r8.menu.LORAWAN_PREAMBLE_LENGTH.1.build.LORAWAN_PREAMBLE_LENGTH=16

heltec_radio_core_s3_r8.menu.LORA_FEM_TYPE.0=USE_NONE_PA (default)
heltec_radio_core_s3_r8.menu.LORA_FEM_TYPE.0.build.LORA_FEM_TYPE=USE_NONE_PA

heltec_radio_core_s3_r8.menu.LORA_RX_LNA.0=Disabled (default)
heltec_radio_core_s3_r8.menu.LORA_RX_LNA.0.build.LORA_RX_LNA=1
heltec_radio_core_s3_r8.menu.LORA_RX_LNA.1=Enabled
heltec_radio_core_s3_r8.menu.LORA_RX_LNA.1.build.LORA_RX_LNA=0

heltec_radio_core_s3_r8.menu.EraseFlash.none=Disabled
heltec_radio_core_s3_r8.menu.EraseFlash.none.upload.erase_cmd=
heltec_radio_core_s3_r8.menu.EraseFlash.all=Enabled
heltec_radio_core_s3_r8.menu.EraseFlash.all.upload.erase_cmd=-e

heltec_radio_core_s3_r8.menu.ZigbeeMode.default=Disabled
heltec_radio_core_s3_r8.menu.ZigbeeMode.default.build.zigbee_mode=
heltec_radio_core_s3_r8.menu.ZigbeeMode.default.build.zigbee_libs=
heltec_radio_core_s3_r8.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
heltec_radio_core_s3_r8.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
heltec_radio_core_s3_r8.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.remote

##############################################################

heltec_radio_core_c6.name=Heltec Radio Core C6

heltec_radio_core_c6.vid.0=0x303a
heltec_radio_core_c6.pid.0=0x1001

heltec_radio_core_c6.bootloader.tool=esptool_py
heltec_radio_core_c6.bootloader.tool.default=esptool_py

heltec_radio_core_c6.upload.tool=esptool_py
heltec_radio_core_c6.upload.tool.default=esptool_py
heltec_radio_core_c6.upload.tool.network=esp_ota

heltec_radio_core_c6.upload.maximum_size=3342336
heltec_radio_core_c6.upload.maximum_data_size=327680
heltec_radio_core_c6.upload.flags=
heltec_radio_core_c6.upload.extra_flags=
heltec_radio_core_c6.upload.use_1200bps_touch=false
heltec_radio_core_c6.upload.wait_for_upload_port=false

heltec_radio_core_c6.serial.disableDTR=false
heltec_radio_core_c6.serial.disableRTS=false

heltec_radio_core_c6.build.tarch=riscv32
heltec_radio_core_c6.build.target=esp
heltec_radio_core_c6.build.mcu=esp32c6
heltec_radio_core_c6.build.core=esp32
heltec_radio_core_c6.build.variant=heltec_radio_core_c6
heltec_radio_core_c6.build.board=HELTEC_RADIO_CORE_C6
heltec_radio_core_c6.build.bootloader_addr=0x0

heltec_radio_core_c6.build.cdc_on_boot=0
heltec_radio_core_c6.build.f_cpu=160000000L
heltec_radio_core_c6.build.flash_size=16MB
heltec_radio_core_c6.build.flash_freq=80m
heltec_radio_core_c6.build.flash_mode=qio
heltec_radio_core_c6.build.boot=qio
heltec_radio_core_c6.build.partitions=default_16MB
heltec_radio_core_c6.build.defines=-D{build.band} -DMCU_ESP32_C6 -DHELTEC_BOARD=81 -DSLOW_CLK_TPYE=0 -DHELTEC_RADIO_CORE_C6 -DRADIO_CHIP_SX1262  -DLoRaWAN_DEBUG_LEVEL={build.LoRaWanDebugLevel} -DACTIVE_REGION=LORAMAC_{build.band} -DLORAWAN_PREAMBLE_LENGTH={build.LORAWAN_PREAMBLE_LENGTH} -DLORAWAN_DEVEUI_AUTO={build.LORAWAN_DEVEUI_AUTO} -DLORA_RX_LNA={build.LORA_RX_LNA} -D{build.LORA_FEM_TYPE} -D{build.board}

## IDE 2.0 Seems to not update the value
heltec_radio_core_c6.menu.JTAGAdapter.default=Disabled
heltec_radio_core_c6.menu.JTAGAdapter.default.build.copy_jtag_files=0
heltec_radio_core_c6.menu.JTAGAdapter.builtin=Integrated USB JTAG
heltec_radio_core_c6.menu.JTAGAdapter.builtin.build.openocdscript=esp32c6-builtin.cfg
heltec_radio_core_c6.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
heltec_radio_core_c6.menu.JTAGAdapter.external=FTDI Adapter
heltec_radio_core_c6.menu.JTAGAdapter.external.build.openocdscript=esp32c6-ftdi.cfg
heltec_radio_core_c6.menu.JTAGAdapter.external.build.copy_jtag_files=1
heltec_radio_core_c6.menu.JTAGAdapter.bridge=ESP USB Bridge
heltec_radio_core_c6.menu.JTAGAdapter.bridge.build.openocdscript=esp32c6-bridge.cfg
heltec_radio_core_c6.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

heltec_radio_core_c6.menu.CDCOnBoot.default=Disabled
heltec_radio_core_c6.menu.CDCOnBoot.default.build.cdc_on_boot=0
heltec_radio_core_c6.menu.CDCOnBoot.cdc=Enabled
heltec_radio_core_c6.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

heltec_radio_core_c6.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
heltec_radio_core_c6.menu.PartitionScheme.default.build.partitions=default
heltec_radio_core_c6.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
heltec_radio_core_c6.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
heltec_radio_core_c6.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
heltec_radio_core_c6.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
heltec_radio_core_c6.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
heltec_radio_core_c6.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
heltec_radio_core_c6.menu.PartitionScheme.minimal.build.partitions=minimal
heltec_radio_core_c6.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
heltec_radio_core_c6.menu.PartitionScheme.no_fs.build.partitions=no_fs
heltec_radio_core_c6.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
heltec_radio_core_c6.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
heltec_radio_core_c6.menu.PartitionScheme.no_ota.build.partitions=no_ota
heltec_radio_core_c6.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
heltec_radio_core_c6.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
heltec_radio_core_c6.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
heltec_radio_core_c6.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
heltec_radio_core_c6.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
heltec_radio_core_c6.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
heltec_radio_core_c6.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
heltec_radio_core_c6.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
heltec_radio_core_c6.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
heltec_radio_core_c6.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
heltec_radio_core_c6.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
heltec_radio_core_c6.menu.PartitionScheme.huge_app.build.partitions=huge_app
heltec_radio_core_c6.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
heltec_radio_core_c6.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/128KB SPIFFS)
heltec_radio_core_c6.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
heltec_radio_core_c6.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
heltec_radio_core_c6.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
heltec_radio_core_c6.menu.PartitionScheme.fatflash.build.partitions=ffat
heltec_radio_core_c6.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
heltec_radio_core_c6.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
heltec_radio_core_c6.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
heltec_radio_core_c6.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
heltec_radio_core_c6.menu.PartitionScheme.rainmaker=RainMaker 4MB
heltec_radio_core_c6.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
heltec_radio_core_c6.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
heltec_radio_core_c6.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
heltec_radio_core_c6.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
heltec_radio_core_c6.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
heltec_radio_core_c6.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
heltec_radio_core_c6.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
heltec_radio_core_c6.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4096000
heltec_radio_core_c6.menu.PartitionScheme.zigbee_2MB=Zigbee 2MB with spiffs
heltec_radio_core_c6.menu.PartitionScheme.zigbee_2MB.build.partitions=zigbee_2MB
heltec_radio_core_c6.menu.PartitionScheme.zigbee_2MB.upload.maximum_size=1310720
heltec_radio_core_c6.menu.PartitionScheme.zigbee=Zigbee 4MB with spiffs
heltec_radio_core_c6.menu.PartitionScheme.zigbee.build.partitions=zigbee
heltec_radio_core_c6.menu.PartitionScheme.zigbee.upload.maximum_size=1310720
heltec_radio_core_c6.menu.PartitionScheme.zigbee_8MB=Zigbee 8MB with spiffs
heltec_radio_core_c6.menu.PartitionScheme.zigbee_8MB.build.partitions=zigbee_8MB
heltec_radio_core_c6.menu.PartitionScheme.zigbee_8MB.upload.maximum_size=3407872
heltec_radio_core_c6.menu.PartitionScheme.zigbee_zczr_2MB=Zigbee ZCZR 2MB with spiffs
heltec_radio_core_c6.menu.PartitionScheme.zigbee_zczr_2MB.build.partitions=zigbee_zczr_2MB
heltec_radio_core_c6.menu.PartitionScheme.zigbee_zczr_2MB.upload.maximum_size=1310720
heltec_radio_core_c6.menu.PartitionScheme.zigbee_zczr=Zigbee ZCZR 4MB with spiffs
heltec_radio_core_c6.menu.PartitionScheme.zigbee_zczr.build.partitions=zigbee_zczr
heltec_radio_core_c6.menu.PartitionScheme.zigbee_zczr.upload.maximum_size=1310720
heltec_radio_core_c6.menu.PartitionScheme.zigbee_zczr_8MB=Zigbee ZCZR 8MB with spiffs
heltec_radio_core_c6.menu.PartitionScheme.zigbee_zczr_8MB.build.partitions=zigbee_zczr_8MB
heltec_radio_core_c6.menu.PartitionScheme.zigbee_zczr_8MB.upload.maximum_size=3407872
heltec_radio_core_c6.menu.PartitionScheme.custom=Custom
heltec_radio_core_c6.menu.PartitionScheme.custom.build.partitions=
heltec_radio_core_c6.menu.PartitionScheme.custom.upload.maximum_size=16777216

heltec_radio_core_c6.menu.CPUFreq.160=160MHz (WiFi)
heltec_radio_core_c6.menu.CPUFreq.160.build.f_cpu=160000000L
heltec_radio_core_c6.menu.CPUFreq.120=120MHz (WiFi)
heltec_radio_core_c6.menu.CPUFreq.120.build.f_cpu=120000000L
heltec_radio_core_c6.menu.CPUFreq.80=80MHz (WiFi)
heltec_radio_core_c6.menu.CPUFreq.80.build.f_cpu=80000000L
heltec_radio_core_c6.menu.CPUFreq.40=40MHz
heltec_radio_core_c6.menu.CPUFreq.40.build.f_cpu=40000000L
heltec_radio_core_c6.menu.CPUFreq.20=20MHz
heltec_radio_core_c6.menu.CPUFreq.20.build.f_cpu=20000000L
heltec_radio_core_c6.menu.CPUFreq.10=10MHz
heltec_radio_core_c6.menu.CPUFreq.10.build.f_cpu=10000000L

heltec_radio_core_c6.menu.FlashMode.qio=QIO
heltec_radio_core_c6.menu.FlashMode.qio.build.flash_mode=dio
heltec_radio_core_c6.menu.FlashMode.qio.build.boot=qio
heltec_radio_core_c6.menu.FlashMode.dio=DIO
heltec_radio_core_c6.menu.FlashMode.dio.build.flash_mode=dio
heltec_radio_core_c6.menu.FlashMode.dio.build.boot=dio

heltec_radio_core_c6.menu.FlashFreq.80=80MHz
heltec_radio_core_c6.menu.FlashFreq.80.build.flash_freq=80m
heltec_radio_core_c6.menu.FlashFreq.40=40MHz
heltec_radio_core_c6.menu.FlashFreq.40.build.flash_freq=40m

heltec_radio_core_c6.menu.FlashSize.16M=16MB (128Mb)
heltec_radio_core_c6.menu.FlashSize.16M.build.flash_size=16MB
heltec_radio_core_c6.menu.FlashSize.8M=8MB (64Mb)
heltec_radio_core_c6.menu.FlashSize.8M.build.flash_size=8MB
heltec_radio_core_c6.menu.FlashSize.4M=4MB (32Mb)
heltec_radio_core_c6.menu.FlashSize.4M.build.flash_size=4MB
heltec_radio_core_c6.menu.FlashSize.2M=2MB (16Mb)
heltec_radio_core_c6.menu.FlashSize.2M.build.flash_size=2MB

heltec_radio_core_c6.menu.UploadSpeed.921600=921600
heltec_radio_core_c6.menu.UploadSpeed.921600.upload.speed=921600
heltec_radio_core_c6.menu.UploadSpeed.115200=115200
heltec_radio_core_c6.menu.UploadSpeed.115200.upload.speed=115200
heltec_radio_core_c6.menu.UploadSpeed.256000.windows=256000
heltec_radio_core_c6.menu.UploadSpeed.256000.upload.speed=256000
heltec_radio_core_c6.menu.UploadSpeed.230400.windows.upload.speed=256000
heltec_radio_core_c6.menu.UploadSpeed.230400=230400
heltec_radio_core_c6.menu.UploadSpeed.230400.upload.speed=230400
heltec_radio_core_c6.menu.UploadSpeed.460800.linux=460800
heltec_radio_core_c6.menu.UploadSpeed.460800.macosx=460800
heltec_radio_core_c6.menu.UploadSpeed.460800.upload.speed=460800
heltec_radio_core_c6.menu.UploadSpeed.512000.windows=512000
heltec_radio_core_c6.menu.UploadSpeed.512000.upload.speed=512000

heltec_radio_core_c6.menu.DebugLevel.none=None
heltec_radio_core_c6.menu.DebugLevel.none.build.code_debug=0
heltec_radio_core_c6.menu.DebugLevel.error=Error
heltec_radio_core_c6.menu.DebugLevel.error.build.code_debug=1
heltec_radio_core_c6.menu.DebugLevel.warn=Warn
heltec_radio_core_c6.menu.DebugLevel.warn.build.code_debug=2
heltec_radio_core_c6.menu.DebugLevel.info=Info
heltec_radio_core_c6.menu.DebugLevel.info.build.code_debug=3
heltec_radio_core_c6.menu.DebugLevel.debug=Debug
heltec_radio_core_c6.menu.DebugLevel.debug.build.code_debug=4
heltec_radio_core_c6.menu.DebugLevel.verbose=Verbose
heltec_radio_core_c6.menu.DebugLevel.verbose.build.code_debug=5

heltec_radio_core_c6.menu.LORAWAN_REGION.0=REGION_EU868
heltec_radio_core_c6.menu.LORAWAN_REGION.0.build.band=REGION_EU868
heltec_radio_core_c6.menu.LORAWAN_REGION.1=REGION_EU433
heltec_radio_core_c6.menu.LORAWAN_REGION.1.build.band=REGION_EU433
heltec_radio_core_c6.menu.LORAWAN_REGION.2=REGION_CN470
heltec_radio_core_c6.menu.LORAWAN_REGION.2.build.band=REGION_CN470
heltec_radio_core_c6.menu.LORAWAN_REGION.3=REGION_US915
heltec_radio_core_c6.menu.LORAWAN_REGION.3.build.band=REGION_US915
heltec_radio_core_c6.menu.LORAWAN_REGION.4=REGION_AU915
heltec_radio_core_c6.menu.LORAWAN_REGION.4.build.band=REGION_AU915
heltec_radio_core_c6.menu.LORAWAN_REGION.5=REGION_CN779
heltec_radio_core_c6.menu.LORAWAN_REGION.5.build.band=REGION_CN779
heltec_radio_core_c6.menu.LORAWAN_REGION.6=REGION_AS923
heltec_radio_core_c6.menu.LORAWAN_REGION.6.build.band=REGION_AS923
heltec_radio_core_c6.menu.LORAWAN_REGION.7=REGION_KR920
heltec_radio_core_c6.menu.LORAWAN_REGION.7.build.band=REGION_KR920
heltec_radio_core_c6.menu.LORAWAN_REGION.8=REGION_IN865
heltec_radio_core_c6.menu.LORAWAN_REGION.8.build.band=REGION_IN865
heltec_radio_core_c6.menu.LORAWAN_REGION.9=REGION_US915_HYBRID
heltec_radio_core_c6.menu.LORAWAN_REGION.9.build.band=REGION_US915_HYBRID

heltec_radio_core_c6.menu.LoRaWanDebugLevel.0=None
heltec_radio_core_c6.menu.LoRaWanDebugLevel.0.build.LoRaWanDebugLevel=0
heltec_radio_core_c6.menu.LoRaWanDebugLevel.1=Freq
heltec_radio_core_c6.menu.LoRaWanDebugLevel.1.build.LoRaWanDebugLevel=1
heltec_radio_core_c6.menu.LoRaWanDebugLevel.2=Freq && DIO
heltec_radio_core_c6.menu.LoRaWanDebugLevel.2.build.LoRaWanDebugLevel=2
heltec_radio_core_c6.menu.LoRaWanDebugLevel.3=Freq && DIO && PW
heltec_radio_core_c6.menu.LoRaWanDebugLevel.3.build.LoRaWanDebugLevel=3

