Heltec-Aaron-Lee/WiFi_Kit_series/boards.txt
heltec_radio_core_c6.menu.LORAWAN_DEVEUI.0=CUSTOM
heltec_radio_core_c6.menu.LORAWAN_DEVEUI.0.build.LORAWAN_DEVEUI_AUTO=0
heltec_radio_core_c6.menu.LORAWAN_DEVEUI.1=Generate By ChipID
heltec_radio_core_c6.menu.LORAWAN_DEVEUI.1.build.LORAWAN_DEVEUI_AUTO=1

heltec_radio_core_c6.menu.LORAWAN_PREAMBLE_LENGTH.0=8(default)
heltec_radio_core_c6.menu.LORAWAN_PREAMBLE_LENGTH.0.build.LORAWAN_PREAMBLE_LENGTH=8
heltec_radio_core_c6.menu.LORAWAN_PREAMBLE_LENGTH.1=16(For M00 and M00L)
heltec_radio_core_c6.menu.LORAWAN_PREAMBLE_LENGTH.1.build.LORAWAN_PREAMBLE_LENGTH=16

heltec_radio_core_c6.menu.LORA_FEM_TYPE.0=USE_NONE_PA (default)
heltec_radio_core_c6.menu.LORA_FEM_TYPE.0.build.LORA_FEM_TYPE=USE_NONE_PA

heltec_radio_core_c6.menu.LORA_RX_LNA.0=Disabled (default)
heltec_radio_core_c6.menu.LORA_RX_LNA.0.build.LORA_RX_LNA=1
heltec_radio_core_c6.menu.LORA_RX_LNA.1=Enabled
heltec_radio_core_c6.menu.LORA_RX_LNA.1.build.LORA_RX_LNA=0

heltec_radio_core_c6.menu.EraseFlash.none=Disabled
heltec_radio_core_c6.menu.EraseFlash.none.upload.erase_cmd=
heltec_radio_core_c6.menu.EraseFlash.all=Enabled
heltec_radio_core_c6.menu.EraseFlash.all.upload.erase_cmd=-e

heltec_radio_core_c6.menu.ZigbeeMode.default=Disabled
heltec_radio_core_c6.menu.ZigbeeMode.default.build.zigbee_mode=
heltec_radio_core_c6.menu.ZigbeeMode.default.build.zigbee_libs=
heltec_radio_core_c6.menu.ZigbeeMode.ed=Zigbee ED (end device)
heltec_radio_core_c6.menu.ZigbeeMode.ed.build.zigbee_mode=-DZIGBEE_MODE_ED
heltec_radio_core_c6.menu.ZigbeeMode.ed.build.zigbee_libs=-lesp_zb_api.ed -lzboss_stack.ed -lzboss_port.native
heltec_radio_core_c6.menu.ZigbeeMode.zczr=Zigbee ZCZR (coordinator/router)
heltec_radio_core_c6.menu.ZigbeeMode.zczr.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
heltec_radio_core_c6.menu.ZigbeeMode.zczr.build.zigbee_libs=-lesp_zb_api.zczr -lzboss_stack.zczr -lzboss_port.native
heltec_radio_core_c6.menu.ZigbeeMode.ed_debug=Zigbee ED (end device) - Debug
heltec_radio_core_c6.menu.ZigbeeMode.ed_debug.build.zigbee_mode=-DZIGBEE_MODE_ED
heltec_radio_core_c6.menu.ZigbeeMode.ed_debug.build.zigbee_libs=-lesp_zb_api.ed.debug -lzboss_stack.ed.debug -lzboss_port.native.debug
heltec_radio_core_c6.menu.ZigbeeMode.zczr_debug=Zigbee ZCZR (coordinator/router) - Debug
heltec_radio_core_c6.menu.ZigbeeMode.zczr_debug.build.zigbee_mode=-DZIGBEE_MODE_ZCZR
heltec_radio_core_c6.menu.ZigbeeMode.zczr_debug.build.zigbee_libs=-lesp_zb_api.zczr.debug -lzboss_stack.zczr.debug -lzboss_port.native.debug

##############################################################
